# AddReferencePoint Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShapeType..::..AddReferencePoint Method
DirectShapeType Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddReferencePoint(XYZ) | Adds a reference point to the DirectShapeType. |
| AddReferencePoint(XYZ, DirectShapeReferenceOptions) | Adds a reference point to the DirectShapeType. |

# See Also
DirectShapeType Class
DirectShapeType Members
Autodesk.Revit.DB Namespace